old_mermaid_graphs.md
```mermaid
stateDiagram-v2
    EF --> VEF: (mEF, k*γ)
    EF --> VESA: (mS2A, ⊤)
    EF --> VESB: (mS2B, ⊤)

    VEF --> EF: (vEF, β)
    VEF --> VEF: (mEF, γ)

    VESA --> EF: (vSA, β)
    VESA --> VESA: (mS2A, ⊤)

    VESB --> EF: (vSB, β)
    VESB --> VESB: (mS2B, ⊤)
```
