old_mermaid_graphs.md
```mermaid
stateDiagram-v2
    MSA --> VSAF: (mEF, ⊤)
    MSA --> VSAS: (mS2B, ⊤)
    MSA --> CA: (mS1A, ωA*γ)

    VSAF --> MSA: (vEF, β)
    VSAF --> VSAF: (mEF, ⊤)

    VSAS --> MSA: (vSB, β)
    VSAS --> VSAS: (mS2B, ⊤)

    CA --> MSA: (mS2A, ωA*γ)
    CA --> VSAF: (mEF, ⊤)
    CA --> VSAS: (mS2B, ⊤)
```
