old_mermaid_graphs.md
```mermaid
stateDiagram-v2
    MSB --> VSBF: (mEF, ⊤)
    MSB --> VSBS: (mS2A, ⊤)
    MSB --> CB: (mS1B, ωB*γ)

    VSBF --> MSB: (vEF, β)
    VSBF --> VSBF: (mEF, ⊤)

    VSBS --> MSB: (vSA, β)
    VSBS --> VSBS: (mS2A, ⊤)

    CB --> MSB: (mS2B, ωB*γ)
    CB --> VSBF: (mEF, ⊤)
    CB --> VSBS: (mS2A, ⊤)
```
